import React from "react";
import Title from "../components/Title";
import { assets } from "../assets/assets";
import NewsletterBox from '../components/NewsletterBox';

const About = () => {
  return (
    <>
      <div className="text-2xl text-center pt-8 border-t">
        <Title text1={"আমাদের"} text2={"সম্পর্কে"} />
      </div>
      <div className="my-10 flex flex-col md:flex-row gap-16">
        <img className="w-full md:max-w-[450px]" src={assets.Hero} alt="" />
        <div className="flex flex-col justify-center gap-6 md:w-2/4 text-gray-600">
          <p>
          আমাদের ভিশন হলো দেশের কৃষি খাতে একটি নির্ভরযোগ্য ও অগ্রগামী অনলাইন কৃষি ব্র্যান্ড হিসেবে প্রতিষ্ঠিত হওয়া। 
          আমরা চাই প্রতিটি কৃষক আধুনিক ও উন্নত কৃষি পদ্ধতির সুবিধা পাক এবং খাদ্য উৎপাদনে স্বনির্ভরতা অর্জন করুক। 
          ভবিষ্যতে আমরা এমন একটি কৃষি ইকোসিস্টেম গড়ে তুলতে চাই, যা কৃষক, ভোক্তা ও 
          পরিবেশ—তিনটির মধ্যেই ইতিবাচক পরিবর্তন আনবে।
          </p>
          <p>
            আমরা বিশ্বাস করি গুণগত মান, সততা ও গ্রাহক সন্তুষ্টিই আমাদের সাফল্যের মূল চাবিকাঠি। 
            প্রতিটি পণ্যের ক্ষেত্রে আমরা মান যাচাই ও নির্ভরযোগ্যতাকে সর্বোচ্চ গুরুত্ব দিই।
             পাশাপাশি কৃষকদের সঙ্গে দীর্ঘমেয়াদি সম্পর্ক গড়ে তোলা, পরিবেশ রক্ষা এবং টেকসই কৃষি
              ব্যবস্থাকে উৎসাহিত করাই আমাদের মূল মূল্যবোধ।
          </p>
          <b className="text-gray-800">🌱 আমাদের মিশন </b>
          <p>
            আমাদের মিশন হলো কৃষকদের হাতে পৌঁছে দেওয়া মানসম্মত, বিশ্বাসযোগ্য ও পরিবেশবান্ধব বীজ, 
            চারা গাছ এবং কৃষি–সম্পর্কিত প্রয়োজনীয় পণ্য। আধুনিক কৃষি জ্ঞান ও প্রযুক্তির সমন্বয়ের মাধ্যমে আমরা 
            এমন একটি প্ল্যাটফর্ম তৈরি করতে চাই, যেখানে কৃষক ও কৃষিপ্রেমীরা সহজেই সঠিক পণ্য ও তথ্য পেতে পারেন।
             আমাদের লক্ষ্য হলো কৃষিকে আরও লাভজনক, টেকসই এবং সহজ করে তোলা।
          </p>
        </div>
      </div>
      <div className="text-4xl py-4">
        <Title text1={"WHY"} text2={"CHOOSE US"} />
        <div className="flex flex-col md:flex-row text-sm mb-20">
          <div className="border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5">
            <b>গুণগত মান নিশ্চিতকরণ:</b>
            <p className="text-gray-600">
              আমরা প্রতিটি বীজ, চারা গাছ ও কৃষি পণ্য কঠোর মান নিয়ন্ত্রণ প্রক্রিয়ার মাধ্যমে যাচাই করি।
               গ্রাহকের কাছে পৌঁছানোর আগে পণ্যের মান ও কার্যকারিতা নিশ্চিত করাই আমাদের প্রধান লক্ষ্য।
            </p>
          </div>
          <div className="border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5">
            <b>বিশ্বাস ও আস্থার নিশ্চয়তা:</b>
            <p className="text-gray-600">
              স্বচ্ছতা ও নির্ভরযোগ্যতার মাধ্যমে আমরা গ্রাহকের আস্থা অর্জনে প্রতিশ্রুতিবদ্ধ।
               প্রতিটি পণ্যের পেছনে রয়েছে আমাদের দায়িত্ববোধ ও প্রমাণিত মানের নিশ্চয়তা।
            </p>
          </div>
          <div className="border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5">
            <b>ব্যতিক্রমধর্মী গ্রাহক সেবা:</b>
            <p className="text-gray-600">
              গ্রাহকের সন্তুষ্টিই আমাদের অগ্রাধিকার, তাই আমরা দ্রুত, আন্তরিক ও দায়িত্বশীল সেবা প্রদান করি।
               বিক্রয়-পূর্ব ও বিক্রয়-পরবর্তী প্রতিটি ধাপে আমরা গ্রাহকের পাশে থাকি।
            </p>
          </div>
        </div>

      </div>
      <NewsletterBox/>
    </>
  );
};

export default About;
